app/views/pages/profile.html.erb

SELECT "gyms".* FROM "gyms" WHERE "gyms"."user_id" = $1  [["user_id", 12]]
---
        <div class="card-body">
          <% current_user.gyms.each do |gym| %>