app/views/pages/profile.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 33]]
SELECT COUNT(*) FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 11]]
---
                  </div>
                  <div class="h5 mb-0 font-weight-bold text-gray-800"><%= current_user.bookings.count %>

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 11]]
---
          <div class="card-body">
            <% current_user.bookings.each do |booking| %>

SELECT "gyms".* FROM "gyms" WHERE "gyms"."user_id" = $1  [["user_id", 12]]
---
        <div class="card-body">
          <% current_user.gyms.each do |gym| %>