app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("user_id", "gym_id", "booking_start", "booking_end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @booking = Booking.new(booking_params)
    @booking.user = current_user
    find_gym
    @booking.gym = @gym
    if @booking.save

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @booking = Booking.find(params[:id])

SELECT "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
  def find_gym
    @gym = Gym.find(params[:gym_id])