app/controllers/gyms_controller.rb

  def index
    @gyms = Gym.all

     @markers = @gyms.geocoded.map do |gym|
---
SELECT "gyms".* FROM "gyms" WHERE (gyms.latitude IS NOT NULL AND gyms.longitude IS NOT NULL)

  def create
    @gym = Gym.new(gym_params)
    @gym.user = current_user
    if @gym.save
---
INSERT INTO "gyms" ("equipment", "location", "type_of_gym", "cost", "name", "user_id", "created_at", "updated_at", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def show
    @gym = Gym.find(params[:id])
---
SELECT "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @gym.update(gym_params)
---
UPDATE "gyms" SET "equipment" = $1, "updated_at" = $2 WHERE "gyms"."id" = $3  [["equipment", "Kettles, Medicine Balls, Bands"], ["updated_at", "2021-08-12 17:53:00.744695"], ["id", 5]]

  def destroy
    @gym.destroy
---
DELETE FROM "gyms" WHERE "gyms"."id" = $1  [["id", 11]]

  def set_gym
    @gym = Gym.find(params[:id])
---
SELECT "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]