app/controllers/pages_controller.rb

  def home
    @gyms = Gym.all
    @first_4 = @gyms.first(4)
---
SELECT "gyms".* FROM "gyms"
SELECT "gyms".* FROM "gyms" ORDER BY "gyms"."id" ASC LIMIT $1  [["LIMIT", 4]]